configuration/src/InformationRegisters/DataAreasExchangeTransportSettings/DataAreasExchangeTransportSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataAreasExchangeTransportSettings</name>
  <comment>Stores settings for the transport of exchange messages that are common to all data areas.</comment>
  <resources>
    <name>FILEDataExchangeDirectory</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FILECompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPCompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionMaxMessageSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPassiveConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPath</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>DefaultExchangeMessagesTransportKind</name>
    <type>
      <types>EnumRef.ExchangeMessagesTransportTypes</types>
    </type>
  </resources>
  <resources>
    <name>DeleteFTPConnectionPassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DeleteExchangeMessageArchivePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CorrespondentEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ExchangeMessagesTransportTypes/ExchangeMessagesTransportTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeMessagesTransportTypes</name>
  <enumValues>
    <name>EMAIL</name>
  </enumValues>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
  <enumValues>
    <name>WSPassiveMode</name>
  </enumValues>
  <enumValues>
    <name>ExternalSystem</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/DataAreasExchangeTransportSettings/Forms/RecordForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetFormItemsVisibility();
	
	If ValueIsFilled(Record.DefaultExchangeMessagesTransportKind) Then
		
		PageName = "TransportSettings[TransportKind]";
		PageName = StrReplace(PageName, "[TransportKind]"
		, Common.EnumerationValueName(Record.DefaultExchangeMessagesTransportKind));
		
		If Items[PageName].Visible Then
			
			Items.TransportKindsPages.CurrentPage = Items[PageName];
			
		EndIf;
	
	EndIf;
	
	If ValueIsFilled(Record.CorrespondentEndpoint) Then
		SetPrivilegedMode(True);
		Passwords = Common.ReadDataFromSecureStorage(Record.CorrespondentEndpoint, "FTPConnectionDataAreasPassword, ArchivePasswordDataAreaExchangeMessages");
		FTPConnectionPassword = ?(ValueIsFilled(Passwords.FTPConnectionDataAreasPassword), ThisObject.UUID, "");
		ArchivePasswordExchangeMessages = ?(ValueIsFilled(Passwords.ArchivePasswordDataAreaExchangeMessages), ThisObject.UUID, "");
		SetPrivilegedMode(False);
	EndIf;
	
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	SetPrivilegedMode(True);
	If FTPConnectionPasswordChanged Then
		Common.WriteDataToSecureStorage(Record.CorrespondentEndpoint, FTPConnectionPassword, "FTPConnectionDataAreasPassword");
	EndIf;
	If ExchangeMessageArchivePasswordChanged Then
		Common.WriteDataToSecureStorage(Record.CorrespondentEndpoint, ArchivePasswordExchangeMessages, "ArchivePasswordDataAreaExchangeMessages");
	EndIf;
	SetPrivilegedMode(False);
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure FILEInformationExchangeDirectoryStartChoice(Item, ChoiceData, StandardProcessing)
	
	DataExchangeClient.FileDirectoryChoiceHandler(Record, "FILEDataExchangeDirectory", StandardProcessing);
	
EndProcedure

&AtClient
Procedure FILEInformationExchangeDirectoryOpening(Item, StandardProcessing)
	
	DataExchangeClient.FileOrDirectoryOpenHandler(Record, "FILEDataExchangeDirectory", StandardProcessing)
	
EndProcedure

&AtClient
Procedure ArchivePasswordExchangeMessagesOnChange(Item)
	ExchangeMessageArchivePasswordChanged = True;
EndProcedure

&AtClient
Procedure FTPConnectionPasswordOnChange(Item)
	FTPConnectionPasswordChanged = True;
EndProcedure

&AtClient
Procedure ArchivePasswordExchangeMessages1OnChange(Item)
	ExchangeMessageArchivePasswordChanged = True;
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure TestFILEConnection(Command)
	
	TestConnection("FILE");
	
EndProcedure

&AtClient
Procedure TestFTPConnection(Command)
	
	TestConnection("FTP");
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure TestConnection(TransportKindAsString)
	
	Cancel = False;
	
	ClearMessages();
	
	TestConnectionAtServer(Cancel, TransportKindAsString);
	
	WarningText = ?(Cancel, NStr("en = 'Cannot establish connection.';"), NStr("en = 'Connection established.';"));
	ShowMessageBox(, WarningText);
	
EndProcedure

&AtServer
Procedure TestConnectionAtServer(Cancel, TransportKindAsString)
	
	PasswordsToCheck = Undefined;
	
	If FTPConnectionPasswordChanged Then
		PasswordsToCheck = New Structure("FTPConnectionPassword", FTPConnectionPassword);
	EndIf;
	
	DataExchangeServer.CheckExchangeMessageTransportDataProcessorAttachment(
		Cancel, Record, Enums.ExchangeMessagesTransportTypes[TransportKindAsString], , PasswordsToCheck);
	
EndProcedure

&AtServer
Procedure SetFormItemsVisibility()
	
	UsedTransports = New Array;
	UsedTransports.Add(Enums.ExchangeMessagesTransportTypes.FILE);
	UsedTransports.Add(Enums.ExchangeMessagesTransportTypes.FTP);
	
	Items.DefaultExchangeMessagesTransportKind.ChoiceList.Clear();
	
	For Each Item In UsedTransports Do
		
		Items.DefaultExchangeMessagesTransportKind.ChoiceList.Add(Item, String(Item));
		
	EndDo;
	
EndProcedure

#EndRegion
